<!-- 8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К». -->

<?php 

$mas = [
    "Московская область" => [
        "Москва",
        "Зеленоград",
        "Клин",
    ],
    "Ленинградская область" => [
        "Санкт-Петербург",
        "Всеволожск",
        "Павловск",
        "Кронштадт"
    ]
];

foreach ($mas as $key => $value) {
    echo $key . ':<br>';
    foreach($value as $value) {
        if (mb_substr($value, 0, 1) === 'К'){
            echo $value . '<br>';
        }
    }
}
?>